# 机   构：上海海事大学
#  开发人： 朱亮
# 开发时间：2022/12/12 17:27

'''
torch.where(condition,a,b)
effect: 按照一定规则合并 两个tensor类型
condition :限制条件，满足a,否则b
a,b是tensor
'''

import torch

import torch

a = torch.tensor([[0.0349, 0.0670, -0.0612, 0.0280, -0.0222, 0.0422],
                  [-1.6719, 0.1242, -0.6488, 0.3313, -1.3965, -0.0682],
                  [-1.3419, 0.4485, -0.6589, 0.1420, -0.3260, -0.4795]])
b = torch.tensor([[-0.0658, -0.1490, -0.1684, 0.7188, 0.3129, -0.1116],
                  [-0.2098, -0.2980, 0.1126, 0.9666, -0.0178, 0.1222],
                  [0.1179, -0.4622, -0.2112, 1.1151, 0.1846, 0.4283]])
cc = torch.where(a > 0, a, b)  # 合并a,b两个tensor，如果a中元素大于0，则c中与a对应的位置取a的值，否则取b的值
print(cc)

# numpy where  输入的是非tensor

import numpy as np

a1 = np.arange(10)
print('a',a1)
c = np.where(a1 % 2 == 0, a1, 10 * a1)
print('c',c)
'''
a [0 1 2 3 4 5 6 7 8 9]
c [ 0 10  2 30  4 50  6 70  8 90]'''